package sceneModule.view.wordmap.model 
{
	/**
	 * ...
	 * @author hao
	 */
	public class MapPacePosInfo 
	{
		private static const OFFSET_X:int=49;
		private static const OFFSET_Y:int=-1;
		private static const OFFSET_YSL:int=5;//塞拉恩特
		public static const POS_INFO:Object = {
			1800: {//众神之域细化地图
				1 : [348, 27, 5109],	//拉瓦蒂庙宇  
				2 : [372, 71, 5112],	//堕落的圣坛 
				3 : [456, 191, 5111],	//夕阳窗台 
				4 : [571, 27, 5108],	//流光隧道 
				5 : [592, 86, 5110],	//众神的墓室
				6 : [593, 203, 5107],	//结晶山裂缝 
				7 : [675, 318, 5103],	//圣山脚下 
				8 : [690, 164, 5104],	//圣山西面 
				9 : [738, 27, 5105],	//圣山神殿 
				10 : [779, 94, 5106]	//悬空梯
			},
			1500: {//塔斯迪罗
				1 : [221, 163, 5076],	//暗杀者之日
				2 : [265, 261, 5078],	//西花园
				3 : [294, 65, 5075],	//野蛮沙巴尔
				4 : [324, 187, 5077],	//黄金战士
				5 : [357, 29, 5073],	//独眼怪之斗
				6 : [393, 279, 5079],	//围墙顶端
				7 : [422, 92, 5074],	//野狼之斗
				8 : [429, 207, 5081],	//东花园
				9 : [465, 331, 5080],	//红酒喷泉
				10 : [605, 359, 5082]	//夕阳庭院
			},
			1400: {//沙布西镇
				1 : [140, 86, 5058],	//错乱的法阵
				2 : [218, 191, 5054],	//封闭的山路
				3 : [221, 357, 5069],	//无罪的羔羊
				4 : [225, 159, 5056],	//狂妄祭台
				5 : [297, 109, 5057],	//饿狼踪迹
				6 : [388, 188, 5055],	//城内街巷
				7 : [443, 95, 5059],	//暴乱战场
				8 : [528, 272, 5064],	//第一前线
				9 : [547, 107, 5060],	//迷幻草地
				10 : [608, 168, 5061],	//血色的战场
				11 : [659, 287, 5063]	//邪神山谷
			},
			1700: {//蓝魔迪域
				1 : [108, 30, 5093],	//火山入口
				2 : [215, 112, 5094],	//地下一层
				3 : [281, 30, 5095],	//地下二层
				4 : [393, 96, 5096],	//女王之穴
				5 : [435, 30, 5097],	//暗黑漩涡
				6 : [453, 220, 5102],	//神的喘息地 
				7 : [540, 31, 5098],	//暗之长廊
				8 : [591, 140, 5101],	//异化之地
				9 : [673, 29, 5099],	//魔物园圃 
				10 : [762, 29, 5100]	//灵魂之井 
			},
			1600: {//布多克部落
				1 : [313, 69, 5084],	//精灵山谷
				2 : [330, 168, 5086],	//兽群之路
				3 : [331, 239, 5090],	//永远的守卫
				4 : [361, 28, 5083],	//狂暴的熊
				5 : [407, 282, 5091],	//圣剑宝库
				6 : [459, 107, 5087],	//困兽之斗
				7 : [475, 360, 5092],	//最后的圣堂
				8 : [491, 28, 5085],	//勇士擂台
				9 : [540, 246, 5089],	//不灭的灵魂
				10 : [560, 127, 5088]	//资格的考验
			},
			1300: {//皇宫
				1 : [496+OFFSET_X+7, 275, 5048],	//回忆长廊
				2 : [583+OFFSET_X+7, 282, 5053],	//流光幻阵
				3 : [478+OFFSET_X+7, 175, 5052],	//中央花园
				4 : [601+OFFSET_X+7, 145, 5046],	//庭院入口
				5 : [598+OFFSET_X+7, 106, 5045],	//陨梦祭坛
				6 : [496+OFFSET_X+7, 112, 5044],	//衰耗的深渊
				7 : [375+OFFSET_X+7, 285, 5049],	//迷途的岔路
				8 : [336+OFFSET_X+7, 185, 5047],	//叹息的甬道
				9 : [386+OFFSET_X+7, 94, 5043],	//急冻冻域
				10 : [270+OFFSET_X+7, 127, 5042],	//炽热牢笼
				11 : [249+OFFSET_X+7, 365, 5050],	//北岸池塘
				12 : [209+OFFSET_X+7, 264, 5051],	//枯竭之泉
				13 : [163+OFFSET_X+7, 183, 5041],	//阴历之地
				14 : [124+OFFSET_X+7, 85, 5040]	//水牢
			},
			1200: {//塞拉
				1 : [398+OFFSET_X+7, 30+OFFSET_YSL, 5028],		//迷雾峡谷
				2 : [228+OFFSET_X+7, 31+OFFSET_YSL, 5027],		//两级之地
				3 : [410+OFFSET_X+7, 134+OFFSET_YSL, 5029],		//寂静地带
				4 : [368+OFFSET_X+7, 206+OFFSET_YSL, 5034],		//草原入口
				5 : [244+OFFSET_X+7, 309+OFFSET_YSL, 5036],		//迷幻草原,幻海平原[5037]
				6 : [563+OFFSET_X+7, 319+OFFSET_YSL, 5035],		//绿之海
				7 : [212+OFFSET_X+7, 212+OFFSET_YSL, 5032],		//峡谷深处
				8 : [105+OFFSET_X+7, 271+OFFSET_YSL, 5038],		//无尽草原
				9 : [62+OFFSET_X+7, 187+OFFSET_YSL, 5039],		//迷幻之海
				10 : [56+OFFSET_X+7, 116+OFFSET_YSL, 5031],		//幽冥峡谷
				11 : [51+OFFSET_X+7, 28+OFFSET_YSL, 5026],		//峡谷边境
				12 : [193+OFFSET_X+7, 83+OFFSET_YSL, 12],		
				13 : [178+OFFSET_X+7, 125+OFFSET_YSL, 5033],		//狂雷峡谷
				14 : [299+OFFSET_X+7, 122+OFFSET_YSL, 5030]		//霜风峡谷
			},
			1100: {//雷格
				1 : [176+OFFSET_X+7, 40+OFFSET_Y, 5011],			//教堂长廊
				2 : [238+OFFSET_X+7, 29+OFFSET_Y, 5010],			//圣地入口
				3 : [319+OFFSET_X+7, 30+OFFSET_Y, 3],			
				4 : [287+OFFSET_X+7, 72+OFFSET_Y, 4],
				5 : [290+OFFSET_X+7, 101+OFFSET_Y, 5],
				6 : [337+OFFSET_X+7, 32+OFFSET_Y, 5012],			//教堂门厅
				7 : [344+OFFSET_X+7, 138+OFFSET_Y, 5014],			//图书馆,礼拜堂[5015]
				8 : [249+OFFSET_X+7, 158+OFFSET_Y, 5016],			//废弃只密道
				9 : [157+OFFSET_X+7, 200+OFFSET_Y, 5017],			//禁地
				10 : [261+OFFSET_X+7, 229+OFFSET_Y, 5018],		//沼泽入口
				11 : [277+OFFSET_X+7, 200+OFFSET_Y, 5019],		//泥潭沼泽
				12 : [333+OFFSET_X+7, 272+OFFSET_Y, 5023],		//沼泽深渊
				13 : [410+OFFSET_X+7, 257+OFFSET_Y, 5020],		//沼泽深处
				14 : [437+OFFSET_X+7, 58+OFFSET_Y, 5013],		//寂静回廊,恶臭沼泽[5012]
				15 : [536+OFFSET_X+7, 148+OFFSET_Y, 5022],		//黑暗沼泽
				16 : [444+OFFSET_X+7, 323+OFFSET_Y, 5024],		//死亡沼泽
				17 : [519+OFFSET_X+7, 236+OFFSET_Y, 5025]		//无尽之轮回
			},
			1000: {//克罗村
				1 : [227+OFFSET_X+5, 118+OFFSET_Y, 5001], //平原入口
				2 : [343+OFFSET_X+5, 107+OFFSET_Y, 5002], //平原小径
				3 : [394+OFFSET_X+5, 158, 5009],          //尽头的秘密--
				4 : [444+OFFSET_X+5, 107+OFFSET_Y, 5004], //平原深处
				5 : [453+OFFSET_X+5, 40+OFFSET_Y, 5003],  //落叶平原
				6 : [563+OFFSET_X+5, 137+OFFSET_Y, 5008], //密林深处
				7 : [444+OFFSET_X+5, 226, 5006],			//森林小径
				8 : [328+OFFSET_X+5, 202, 5005], 			//森林入口
				9 : [369+OFFSET_X+5, 328+OFFSET_Y, 5062], //荧光森林
				10 : [504+OFFSET_X+5, 355+OFFSET_Y, 5007] //密林地带
			},
			0: { //世界地图
				1 : [62, 119, 1600], //武威
				2 :	[71,210,	1500], //	天水
				3 :	[260,223,	1700], //	长安
				4 :	[135,265,	1400], //	汉中
				5 :	[116,314,	1300], //	辛童
				6 :	[34,363,	1100], //	成都
				7 :	[16,433,	1000], //	南中
				8 :	[191,328,	1200], //	江州
				9 :	[297,356,	1900], //	永安
				10 :	[331,295,	1800], //	西城
				11 :	[397,319,	2300], //	襄阳
				12 :	[390,364,	2400], //	江陵
				13 :	[472,319,	3000], //	新野
				14 :	[402,193,	2100], //	洛阳
				15 :	[418,92,	2000], //	晋阳
				16 :	[404,285,	2200], //	宛
				17 :	[506,272,	2900], //	许昌
				18 :	[499,330,	3100], //	江夏
				19 :	[438,410,	3200], //	长沙
				20 :	[408,471,	2600], //	零陵
				21 :	[493,487,	3300], //	桂阳
				22 :	[560,387,	3900], //	柴桑
				23 :	[578,346,	4400], //	庐江
				24 :	[548,235,	3800], //	汝南
				25 :	[548,223,	2800], //	陈留
				26 :	[638,301,	4300], //	寿春
				27 :	[681,317,	4600], //	姊陵
				28 :	[683,185,	4500], //	下邳
				29 :	[658,220,	4200], //	小沛
				30 :	[583,185,	3700], //	濮阳
				31 :	[517,117,	2700], //	业
				32 :	[588,157,	3600], //	平原
				33 :	[558,112,	3500], //	南皮
				34 :	[516,45,	3400], //	蓟 
				35 :	[639,0,	4000], //	北平
				36 :	[809,0,	4700], //	嚷平
				37 :	[765,317,	4800], //	吴
				38 :	[669,372,	4900], //	会计
				39 :	[646, 135,	4100], //	北海
				40 : 	[315, 408, 2500] //武陵
			}
		}
		
	}

}